package OOP;
/*
    클래스에서 생성자란 무엇이고 어떤 특징을 갖고 있는지 말해보시오.
    이 문제는 클래서에서 생성자의 개념과 역할, 특징 등에 대해서 알고 있는지를 묻는 문제이다.

    ---------------------------------------------------------
    [내 풀이]
    생성자란 클래스에 따른 객체를 생성할 때 자동으로 호출되는 메서드를 말한다.
    생성자명은 클래스명과 동일해야하며 반환타입이 없다.
    또한 생성자는 오버로딩, 즉 중복정의가 가능하다.
    만약 클래스에 정의되어 있는 생성자가 하나도 없으면 컴파일러가 자동으로 매개변수가 없고, 작동하는 코드가 없는 기본 생성자를 만들어준다.
    이때 자동으로 만들어지는 기본 생성자의 접근 제어자는 해당 클래스와 동일한 접근 제어자이다.
    ---------------------------------------------------------
    [쌤 풀이]
 */

public class Java100_oop_Exam005 {
}
