package OOP;

/*
    클래스란 무엇이고 어떤 역할을 하는지에 대해서 설명해 보시오.
    이 문제는 클래스의 개념과 역할, 용도 등에 대해서 알고 있는지를 묻는 문제이다.

    -----------------------------------------------------------------------

    [내 풀이]
    클래스란 서로 다른 타입의 변수를 하나의 변수로써 관리하기 위하여 만드는 사용자 정의 타입의 설계도를 말한다.

    *** 서로 다른 타입의 변수를 하나의 변수로써 관리하기 위하여 객체를 사용자 정의 타입을 만드는데 필요한 설계도로서,
    만들고자 하는 객체를 속성과 메서드의 개념으로 이해하여 설계한다.

    -----------------------------------------------------------------------

    [쌤 풀이]
    [1]: 클래스란 무엇인가?
    클래스란 객체(또는 인스턴스)를 생성하는 하나의 공장(= 틀, 프레임, 템플릿, 판형)이다.
    만들고자 하는 객체의 특징과 동작으로 나누어 설계한다.
 */

public class WhatIsClass {
    public static void main(String[] args) {

    }
}
